aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
ble_gap_sec_params_t xSecurityParameters =
{
    .bond           = true,
    .mitm           = true,
    .lesc           = true,
    .keypress       = 0,
    .io_caps        = BLE_GAP_IO_CAPS_DISPLAY_YESNO,
    .oob            = 0,
    .min_key_size   = 7,
    .max_key_size   = 16,
    .kdist_own.enc  = 1,
    .kdist_own.id   = 1,
    .kdist_peer.enc = 1,
    .kdist_peer.id  = 1,
};

/*-----------------------------------------------------------*/


static ret_code_t prvDataLengthUpdate( uint16_t usConnHandle,
                                       uint16_t usDataLength )
{
    configPRINTF(( "Updating data length to %u on connection 0x%x.",
                   usDataLength, usConnHandle ));

    ble_gap_data_length_params_t const dlp =
    {
        .max_rx_octets  = usDataLength,
        .max_tx_octets  = usDataLength,
        .max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
        .max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
    };

    ble_gap_data_length_limitation_t dll = { 0 };

    ret_code_t err_code = sd_ble_gap_data_length_update( usConnHandle, &dlp, &dll );

    if( err_code != NRF_SUCCESS )
    {
        configPRINTF(( "sd_ble_gap_data_length_update() (request) on connection 0x%x returned %s.",
                       usConnHandle, nrf_strerror_get( err_code ) ));

        if( ( dll.tx_payload_limited_octets != 0 ) ||
            ( dll.rx_payload_limited_octets != 0 ) )
        {
            configPRINTF(( "The requested TX/RX packet length is too long by %u/%u octets.",
                           dll.tx_payload_limited_octets, dll.rx_payload_limited_octets ));
        }

        if( dll.tx_rx_time_limited_us != 0 )
        {
            configPRINTF(( "The requested combination of TX and RX packet lengths "
                           "is too long by %u microseconds.",
                           dll.tx_rx_time_limited_us ));
        }
    }

    return err_code;
}

/*-----------------------------------------------------------*/

ret_code_t xBTGattUpdateMtu( nrf_ble_gatt_t * pxGattHandler,
                             uint16_t usConnHandle )
{
    ret_code_t xErrCode = NRF_SUCCESS;

    if( pxGattHandler == NULL )
    {
        xErrCode = NRF_ERROR_NULL;
    }

    if( xErrCode == NRF_SUCCESS )
    {
        nrf_ble_gatt_link_t * xLink = &pxGattHandler->links[ usConnHandle ];
        xLink->att_mtu_desired = pxGattHandler->att_mtu_desired_periph;

        if( xLink->att_mtu_desired > xLink->att_mtu_effective )
        {

            xErrCode = sd_ble_gattc_exchange_mtu_request( usConnHandle, xLink->att_mtu_desired );

            if( xErrCode == NRF_SUCCESS )
            {
                xLink->att_mtu_exchange_requested = true;
            }
            else if( xErrCode == NRF_ERROR_BUSY )
            {
                xLink->att_mtu_exchange_pending = true;
                configPRINTF(( "sd_ble_gattc_exchange_mtu_request()"
                               " on connection 0x%x returned busy, will retry.", usConnHandle ));
            }
            else
            {
                configPRINTF(( "sd_ble_gattc_exchange_mtu_request() returned %s.",
                               nrf_strerror_get( xErrCode ) ));
            }
        }

        /* Send a data length update request if necessary. */
        if( xLink->data_length_desired > xLink->data_length_effective )
        {
            ( void ) prvDataLengthUpdate( usConnHandle, xLink->data_length_desired );
        }
    }

    return xErrCode;
}


ret_code_t prvResumeAdvertisement(uint8_t ucAdvMode)
{
      ret_code_t xErrCode;
       xAdvertisingHandle.adv_params.properties.type = ucAdvMode;
      xErrCode = sd_ble_gap_adv_set_configure(&xAdvertisingHandle.adv_handle, xAdvertisingHandle.p_adv_data, &xAdvertisingHandle.adv_params);
      if( xErrCode == NRF_SUCCESS )
      {
          xErrCode = sd_ble_gap_adv_start( xAdvertisingHandle.adv_handle, aws_ble_gap_configAPP_BLE_CONN_CFG_TAG );
      }
       return xErrCode;
}
/*-----------------------------------------------------------*/

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
void prvGAPeventHandler( ble_evt_t const * p_ble_evt,
                         void * p_context )
{
    BTUuid_t xUuid;
    ret_code_t xErrCode = NRF_SUCCESS;
    uint16_t usLocalHandle = 0;
    nrf_ble_gatt_t * xGattHandler = prvGetGattHandle();

    ble_gap_phys_t const xPhys =
    {
        .rx_phys = BLE_GAP_PHY_AUTO,
        .tx_phys = BLE_GAP_PHY_AUTO,
    };

    switch( p_ble_evt->header.evt_id )
    {
        case BLE_GAP_EVT_CONNECTED:
            usGattConnHandle = p_ble_evt->evt.gap_evt.conn_handle;
            bIsConnected = true;

            if( bIsAdvertising == true)
            {
                xErrCode = prvResumeAdvertisement(BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED); 
                if(xErrCode != NRF_SUCCESS)
                {
                    configPRINTF(( "Could not switch to non connectable advertisement. \n" ));
                }
            }

            memcpy( &xConnectionRemoteAddress.ucAddress, p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr, BLE_GAP_ADDR_LEN );

            if( ( xErrCode == NRF_SUCCESS ) && bGattInitialized )
            {
                xErrCode = nrf_ble_gatt_att_mtu_periph_set( xGattHandler, xProperties.ulMtu );
            }

            if( ( xErrCode == NRF_SUCCESS ) && bGattInitialized )
            {
                xErrCode = xBTGattUpdateMtu( xGattHandler, usGattConnHandle );
            }

            if( xGattServerCb.pxConnectionCb )
            {
                xGattServerCb.pxConnectionCb( p_ble_evt->evt.gap_evt.conn_handle, 
                                              ulGattServerIFhandle, 
                                              true, 
                                              &xConnectionRemoteAddress );
            }

            break;

        case BLE_GAP_EVT_DISCONNECTED:

            bIsConnected = false;
            /* Switch advertisement to connectable. */
            if( bIsAdvertising == true)
            {
                 xErrCode = prvStopAdv();
                 if( xErrCode == NRF_SUCCESS)
                 {
                     xErrCode = prvResumeAdvertisement(BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED);
                 }

