aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
            xGattServerCb.pxIndicationSentCb( p_ble_evt->evt.gap_evt.conn_handle, xErrCode );
            break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:

            xGattServerCb.pxIndicationSentCb( p_ble_evt->evt.gap_evt.conn_handle, xErrCode );
            break;

        case BLE_GATTC_EVT_TIMEOUT:

            configPRINTF(( "BLE_GATTC_EVT_TIMEOUT \n" ));

            /* Disconnect on GATT Client timeout event. */
            configPRINTF(( "GATT Client Timeout." ));
            xErrCode = sd_ble_gap_disconnect( p_ble_evt->evt.gattc_evt.conn_handle,
                                              BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION );
            APP_ERROR_CHECK( xErrCode );
            break;

        case BLE_GATTS_EVT_TIMEOUT:

            configPRINTF(( "BLE_GATTS_EVT_TIMEOUT \n" ));

            /* Disconnect on GATT Server timeout event. */
            configPRINTF(( "GATT Server Timeout." ));
            xErrCode = sd_ble_gap_disconnect( p_ble_evt->evt.gatts_evt.conn_handle,
                                              BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION );
            APP_ERROR_CHECK( xErrCode );
            break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:

            if( xGattServerCb.pxMtuChangedCb != NULL )
            {
                xGattServerCb.pxMtuChangedCb( p_ble_evt->evt.gap_evt.conn_handle, p_ble_evt->evt.gattc_evt.params.exchange_mtu_rsp.server_rx_mtu );
            }

            break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:

            if( xGattServerCb.pxMtuChangedCb != NULL )
            {
                xGattServerCb.pxMtuChangedCb( p_ble_evt->evt.gap_evt.conn_handle, p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu );
            }

            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:

            if( xBTBleAdapterCallbacks.pxConnParameterUpdateCb )
            {
                uint16_t usActualInterval = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
                BTStatus_t xStatus = eBTStatusSuccess;

                if( ( usActualInterval > xLatestDesiredConnectionParams.ulMaxInterval ) || ( usActualInterval < xLatestDesiredConnectionParams.ulMinInterval ) )
                {
                    xStatus = eBTStatusFail;
                }

                xBTBleAdapterCallbacks.pxConnParameterUpdateCb( xStatus,
                                                                xLatestDesiredConnectionParams.pxBdAddr,
                                                                xLatestDesiredConnectionParams.ulMinInterval,
                                                                xLatestDesiredConnectionParams.ulMaxInterval,
                                                                xLatestDesiredConnectionParams.ulLatency,
                                                                usActualInterval,
                                                                xLatestDesiredConnectionParams.ulTimeout );
            }

            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
       
            xErrCode = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &xPhys);
            APP_ERROR_CHECK(xErrCode);
            break;
            

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:

            break;

        case BLE_GAP_EVT_CONN_SEC_UPDATE:

            if( xBTCallbacks.pxPairingStateChangedCb )
            {
                xBTCallbacks.pxPairingStateChangedCb( eBTStatusSuccess,
                                                      &xConnectionRemoteAddress,
                                                      p_ble_evt->evt.gap_evt.params.conn_sec_update.conn_sec.sec_mode.lv,
                                                      0
                                                      );
            }

            break;

        case BLE_GAP_EVT_AUTH_KEY_REQUEST:

            break;

        case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
            nrf_ble_lesc_request_handler();
            break;

        case BLE_GAP_EVT_PASSKEY_DISPLAY:

            if( xBTCallbacks.pxSspRequestCb )
            {
                uint32_t ulPasskey = strtoul(
                    p_ble_evt->evt.gap_evt.params.passkey_display.passkey,
                    NULL,
                    10 );
                if( p_ble_evt->evt.gap_evt.params.passkey_display.match_request == 1 )
                {
                    xBTCallbacks.pxSspRequestCb( &xConnectionRemoteAddress,
                                                 NULL,
                                                 0,
                                                 eBTsspVariantPasskeyConfirmation,
                                                 ulPasskey );
                }
                else
                {
                    xBTCallbacks.pxSspRequestCb( &xConnectionRemoteAddress,
                                                 NULL,
                                                 0,
                                                 eBTsspVariantPasskeyNotification,
                                                 ulPasskey );
                }
            }

            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:

            /* No system attributes have been stored. */
            xErrCode = sd_ble_gatts_sys_attr_set( usGattConnHandle, NULL, 0, 0 );
            APP_ERROR_CHECK( xErrCode );
            break;

        case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP:
            /* configPRINTF((( "BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP\n" ); */
            break;

        case BLE_GAP_EVT_SEC_INFO_REQUEST:
            /* configPRINTF((( "BLE_GAP_EVT_SEC_INFO_REQUEST\n" ); */
            break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
            /* configPRINTF((( "BLE_GAP_EVT_DATA_LENGTH_UPDATE\n" ); */
            break;

        case BLE_GAP_EVT_AUTH_STATUS:

            break;

        default:       
            configPRINTF(( "UNKNOWN BLE EVENT %d\n", p_ble_evt->header.evt_id ));

            break;
    }
}

/*-----------------------------------------------------------*/

