aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
                       current_peer_id = pm_next_peer_id_get( current_peer_id );
                   }

                   xReturnedProperty.pvVal = pucBondedAddresses;
                   xReturnedProperty.xLen = peer_count;
                   xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
               }

               break;

            case eBTpropertySecureConnectionOnly:
                xReturnedProperty.pvVal = &xProperties.bOnlySecure;
                xReturnedProperty.xLen = 1;
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );

            default:
                xStatus = eBTStatusUnsupported;
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusFail, 0, NULL );
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetDeviceProperty( const BTProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xNRFstatus = NRF_SUCCESS;
    nrf_ble_gatt_t * xGattHandler = prvGetGattHandle();

    switch( pxProperty->xType )
    {
        case eBTpropertyBdname:

            xProperties.usDeviceNameLength = pxProperty->xLen;
            vPortFree( xProperties.puDeviceName );
            xProperties.puDeviceName = ( uint8_t * ) pvPortMalloc( xProperties.usDeviceNameLength );

            if( xProperties.puDeviceName != NULL )
            {
                memcpy( xProperties.puDeviceName, ( pxProperty->pvVal ), xProperties.usDeviceNameLength );

                ble_gap_conn_sec_mode_t xSecurityMode;
                #if bleconfigREQUIRE_MITM
                    BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM( &xSecurityMode ); /* TODO: Implement setting security modes */
                #else
                    BLE_GAP_CONN_SEC_MODE_SET_OPEN( &xSecurityMode );
                #endif
                xNRFstatus = sd_ble_gap_device_name_set( &xSecurityMode, xProperties.puDeviceName, xProperties.usDeviceNameLength );

                if( xNRFstatus != NRF_SUCCESS )
                {
                    xStatus = eBTStatusFail;
                }
            }
            else
            {
                xStatus = eBTStatusNoMem;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyBdaddr:

            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertyTypeOfDevice:

            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertyLocalMTUSize: /* TODO: Check if we should save gatt handler from connection even and update its MTU */
            xProperties.ulMtu = *( ( uint32_t * ) pxProperty->pvVal );

            if( bGattInitialized )
            {
                xNRFstatus = nrf_ble_gatt_att_mtu_periph_set( xGattHandler, xProperties.ulMtu );

                if( ( xNRFstatus == NRF_SUCCESS ) && bIsConnected )
                {
                    xNRFstatus = xBTGattUpdateMtu( xGattHandler, usGattConnHandle );
                }
            }

            xStatus = BTNRFError( xNRFstatus );

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyBondable:
            xProperties.bBondable = *( ( bool * ) pxProperty->pvVal );

            if( xProperties.bBondable == true )
            {
                xSecurityParameters.bond = true;
                xSecurityParameters.kdist_own.enc = 1;
                xSecurityParameters.kdist_own.id = 1;
                xSecurityParameters.kdist_peer.enc = 1;
                xSecurityParameters.kdist_peer.id = 1;
            }
            else
            {
                xSecurityParameters.bond = false;
                xSecurityParameters.kdist_own.enc = 0;
                xSecurityParameters.kdist_own.id = 0;
                xSecurityParameters.kdist_peer.enc = 0;
                xSecurityParameters.kdist_peer.id = 0;
            }

            xNRFstatus = pm_sec_params_set( &xSecurityParameters );

            if( xNRFstatus != NRF_SUCCESS )
            {
                xStatus = eBTStatusFail;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyIO:

            switch( *( ( BTIOtypes_t * ) pxProperty->pvVal ) )
            {
                case eBTIODisplayOnly:
                    xSecurityParameters.io_caps = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
                    break;

                case eBTIODisplayYesNo:
                    xSecurityParameters.io_caps = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
                    break;

                case eBTIOKeyboardOnly:
                    xSecurityParameters.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
                    break;

                case eBTIOKeyboardDisplay:
                    xSecurityParameters.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
                    break;

                default:
                    xSecurityParameters.io_caps = BLE_GAP_IO_CAPS_NONE;
                    xSecurityParameters.mitm = false;
                    break;
            }

            xNRFstatus = pm_sec_params_set( &xSecurityParameters );

            if( xNRFstatus != NRF_SUCCESS )
            {
                xStatus = eBTStatusFail;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertySecureConnectionOnly:

