aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
            if( *( ( bool * ) pxProperty->pvVal ) )
            {
                if( xSecurityParameters.io_caps == BLE_GAP_IO_CAPS_NONE )
                {
                    xStatus = eBTStatusUnsupported;
                }
                else
                {
                    xProperties.bOnlySecure = true;
                }
            }
            else
            {
                xProperties.bOnlySecure = false;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        default:
            xStatus = eBTStatusUnsupported;
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetAllRemoteDeviceProperties( BTBdaddr_t * pxRemoteAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         BTPropertyType_t type )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         const BTProperty_t * property )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTPair( const BTBdaddr_t * pxBdAddr,
                      BTTransport_t xTransport,
                      bool bCreateBond )
{
    ( void * ) xTransport; /* We use BLE anyway */
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTCreateBondOutOfBand( const BTBdaddr_t * pxBdAddr,
                                     BTTransport_t xTransport,
                                     const BTOutOfBandData_t * pxOobData )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTCancelBond( const BTBdaddr_t * pxBdAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTRemoveBond( const BTBdaddr_t * pxBdAddr )
{
    /*#define DELETE_ALL_BONDS */
    int peer_count = 0;
    ret_code_t xErrCode = NRF_SUCCESS;
    BTStatus_t xStatus = eBTStatusSuccess;

    #ifdef DELETE_ALL_BONDS
        xErrCode = pm_peers_delete();
    #else
        pm_peer_data_bonding_t bonding_data;
        pm_peer_id_t current_peer_id = pm_next_peer_id_get( PM_PEER_ID_INVALID );

        while( current_peer_id != PM_PEER_ID_INVALID )
        {
            xErrCode = pm_peer_data_bonding_load( current_peer_id, &bonding_data );
            /* TODO: Resolve real addresses */
            /* if (!memcmp(pxBdAddr->ucAddress, bonding_data.peer_ble_id.id_addr_info.addr, btADDRESS_LEN )) { */
            break;
            /*  }; */
            peer_count += 1;

            if( peer_count >= bleconfigMAX_BONDED_DEVICES )
            {
                xErrCode = NRF_ERROR_NOT_FOUND;
                break;
            }

            current_peer_id = pm_next_peer_id_get( current_peer_id );
        }

        if( current_peer_id == PM_PEER_ID_INVALID )
        {
            xErrCode = NRF_ERROR_NOT_FOUND;
        }

        if( xErrCode == NRF_SUCCESS )
        {
            xErrCode = pm_peer_delete( current_peer_id );
        }
    #endif /* ifdef DELETE_ALL_BONDS */
    xStatus = BTNRFError( xErrCode );

    if( ( xBTCallbacks.pxBondedCb != NULL ) )
    {
        xBTCallbacks.pxBondedCb( xStatus, pxBdAddr, 0 );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetConnectionState( const BTBdaddr_t * pxBdAddr )
{
    return 0;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTPinReply( const BTBdaddr_t * pxBdAddr,
                          uint8_t ucAccept,
                          uint8_t ucPinLen,
                          BTPinCode_t * pxPinCode )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSspReply( const BTBdaddr_t * pxBdAddr,
                          BTSspVariant_t xVariant,
                          uint8_t ucAccept,
                          uint32_t ulPasskey )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;
    uint8_t passKey[ 6 ];

    switch( xVariant )
    {
        case eBTsspVariantPasskeyConfirmation:

            if( ucAccept )
            {
                xErrCode = sd_ble_gap_auth_key_reply( usGattConnHandle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, NULL );
            }
            else
            {
                xErrCode = sd_ble_gap_auth_key_reply( usGattConnHandle, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL );
            }

        case eBTsspVariantPasskeyEntry: /* TODO: Implement */
        case eBTsspVariantPasskeyNotification:
            break;

        default:
            break;
    }

    BT_NRF_PRINT_ERROR( pm_conn_secure, xErrCode );

    if(xErrCode != NRF_SUCCESS)
    {
        xStatus = eBTStatusFail;
    }
/*    ret_code_t xErrCode = pm_conn_secure(usGattConnHandle, false); */

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTReadEnergyInfo()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeConfigure( bool bEnable )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeSend( uint16_t usOpcode,
                             uint8_t * pucBuf,
                             size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTLeTestMode( uint16_t usOpcode,
                            uint8_t * pucBuf,
                            size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigHCISnoopLog( bool bEnable )
{
    return eBTStatusUnsupported;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigClear()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

