aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
BTStatus_t prvBTReadRssi( const BTBdaddr_t * pxBdAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetTxpower( const BTBdaddr_t * pxBdAddr,
                            BTTransport_t xTransport )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

const void * prvGetClassicAdapter()
{
    return NULL;
}

/*-----------------------------------------------------------*/

const BTInterface_t * BTGetBluetoothInterface()
{
    return &xBTinterface;
}

void prvPmEventHandler( const pm_evt_t * event )
{
    pm_handler_on_pm_evt( event );
    pm_handler_flash_clean( event );
    pm_conn_sec_config_t conn_sec_config;

    ret_code_t err_code;
/*    configPRINTF(((  0, "PM_EVT: %d\n", event->evt_id ); */

    switch( event->evt_id )
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
            if( xBTCallbacks.pxBondedCb )
            {
                xBTCallbacks.pxBondedCb( eBTStatusSuccess,
                                         &xConnectionRemoteAddress,
                                         true );
            }

            break;

/*            configPRINTF(((  0, "PM_EVT_CONN_SEC_SUCCEEDED\n" ); */
        case PM_EVT_CONN_SEC_CONFIG_REQ:
           /* Repairing attempt between already bonded devices */
           {
               conn_sec_config.allow_repairing = true;
               pm_conn_sec_config_reply( event->conn_handle, &conn_sec_config );
           }
           break;

        case PM_EVT_CONN_SEC_START:
            /* This is an informational event; no action is needed for the procedure to proceed. */
/*            configPRINTF((( "PM_EVT_CONN_SEC_START\n" ); */
            {
                BTSspVariant_t xPairingVariant = eBTsspVariantConsent;
                switch( event->params.conn_sec_start.procedure )
                {
                    case PM_CONN_SEC_PROCEDURE_ENCRYPTION:
                        xPairingVariant = eBTsspVariantPasskeyConfirmation;
                        break;

                    PM_CONN_SEC_PROCEDURE_BONDING:
                        xPairingVariant = eBTsspVariantConsent;
                        break;

                    PM_CONN_SEC_PROCEDURE_PAIRING:
                        xPairingVariant = eBTsspVariantConsent;
                        break;
                }
                /* TODO: Rework for different security levels */
                if( xBTCallbacks.pxSspRequestCb )
                {
                    xBTCallbacks.pxSspRequestCb( &xConnectionRemoteAddress,
                                                 NULL,
                                                 0,
                                                 eBTsspVariantConsent,
                                                 0 );
                }
            }
            break;

        case PM_EVT_CONN_SEC_PARAMS_REQ:

            if( xProperties.bOnlySecure )
            {
                if( event->params.conn_sec_params_req.p_peer_params &&
                    ( event->params.conn_sec_params_req.p_peer_params->mitm == 0 ) ) /* The peer tries to connect in "Just Works" mode */
                {
                    sd_ble_gap_sec_params_reply( event->conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL );

                    if( xBTCallbacks.pxPairingStateChangedCb )
                    {
                        xBTCallbacks.pxPairingStateChangedCb( eBTStatusFail,
                                                              &xConnectionRemoteAddress,
                                                              eBTSecLevelNoSecurity,
                                                              eBTauthFailInsuffSecurity );
                    }
                }
            }

            /* TODO: Rework for the cases other than just works */
/*            if (xBTCallbacks.pxSspRequestCb) { */
/*                xBTCallbacks.pxSspRequestCb(NULL, */
/*                                            NULL, */
/*                                            0, */
/*                                            eBTsspVariantPasskeyConfirmation, */
/*                                            0); */
/*            } */
            break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
/*            configPRINTF((( "PM_EVT_PEER_DATA_UPDATE_SUCCEEDED\n" ); */

            if( xBTCallbacks.pxBondedCb )
            {
                if( event->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING )
                {
                    if( event->params.peer_data_update_succeeded.action == PM_PEER_DATA_OP_UPDATE ) /* TODO: What is the difference? */
                    {
                        xBTCallbacks.pxBondedCb( eBTStatusSuccess,
                                                 &xConnectionRemoteAddress,
                                                 true );
                    }
                    else
                    {
                        xBTCallbacks.pxBondedCb( eBTStatusSuccess,
                                                 &xConnectionRemoteAddress,
                                                 true );
                    }
                }
            }
            break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
/*            configPRINTF((( "PM_EVT_CONN_SEC_SUCCEEDED\n" ); */
            break;

        case PM_EVT_CONN_SEC_FAILED:
/*            configPRINTF((( "PM_EVT_CONN_SEC_FAILED\n" ); */
            configPRINTF(( "Failed to secure connection. Disconnecting." ));
            err_code = sd_ble_gap_disconnect( event->conn_handle,
                                              BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION );

            if( err_code != NRF_ERROR_INVALID_STATE )
            {
                APP_ERROR_CHECK( err_code );
            }

            usGattConnHandle = BLE_CONN_HANDLE_INVALID;
            break;

        case PM_EVT_STORAGE_FULL:
            /* Run garbage collection on the flash. */
            err_code = fds_gc();

            if( err_code == FDS_ERR_NO_SPACE_IN_QUEUES )
            {
                /* Retry. */
            }
            else
            {
                APP_ERROR_CHECK( err_code );
            }

            break;

        case PM_EVT_PEER_DELETE_SUCCEEDED:
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        /* This can happen when the local DB has changed. */
            break;

        case PM_EVT_SERVICE_CHANGED_IND_SENT:
            break;

        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
            break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peer_data_update_failed.error );
            break;

        case PM_EVT_PEER_DELETE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peer_delete_failed.error );
            break;

        case PM_EVT_PEERS_DELETE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peers_delete_failed_evt.error );
            break;

        case PM_EVT_ERROR_UNEXPECTED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.error_unexpected.error );
            break;

        default:
            configPRINTF(("PM_UNKNOWN, %d\n ", event->evt_id ));
            break;
    }
}
